<a href="https://colab.research.google.com/github/dm-fedorov/pandas_basic/blob/master/кейсы%20по%20анализу%20данных/Про_заказы_индексы.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory" target="_blank"></a>

### Преобразование данных в индекс и получение данных из индекса

In [1]:
import pandas as pd
import numpy as np

In [2]:
url = "https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/data/orders.csv"

In [3]:
orders = pd.read_csv(url, index_col='id')
orders.head()

        order_date ship_mode customer_id    sales
id
100006  2014-09-07  Standard    DK-13375  377.970
100090  2014-07-08  Standard    EB-13705  699.192
100293  2014-03-14  Standard    NF-18475   91.056
100328  2014-01-28  Standard    JC-15340    3.928
100363  2014-04-08  Standard    JM-15655   21.376

Сбрасываем индекс, помещая значения индекса в столбец:

In [4]:
index_moved_to_col = orders.reset_index()
index_moved_to_col.head()

       id  order_date ship_mode customer_id    sales
0  100006  2014-09-07  Standard    DK-13375  377.970
1  100090  2014-07-08  Standard    EB-13705  699.192
2  100293  2014-03-14  Standard    NF-18475   91.056
3  100328  2014-01-28  Standard    JC-15340    3.928
4  100363  2014-04-08  Standard    JM-15655   21.376

А теперь делаем столбец id индексом:

In [5]:
index_moved_to_col.set_index('id').head()

        order_date ship_mode customer_id    sales
id
100006  2014-09-07  Standard    DK-13375  377.970
100090  2014-07-08  Standard    EB-13705  699.192
100293  2014-03-14  Standard    NF-18475   91.056
100328  2014-01-28  Standard    JC-15340    3.928
100363  2014-04-08  Standard    JM-15655   21.376

Переиндексировать:

In [6]:
orders.reindex(index=[100293, 100006, 1111111])

         order_date ship_mode customer_id    sales
id
100293   2014-03-14  Standard    NF-18475   91.056
100006   2014-09-07  Standard    DK-13375  377.970
1111111         NaN       NaN         NaN      NaN

In [7]:
orders.reindex(columns=["order_date", "ship_mode", "mode"])

        order_date ship_mode  mode
id
100006  2014-09-07  Standard   NaN
100090  2014-07-08  Standard   NaN
100293  2014-03-14  Standard   NaN
100328  2014-01-28  Standard   NaN
100363  2014-04-08  Standard   NaN
...            ...       ...   ...
168802  2017-11-03  Standard   NaN
169320  2017-07-23    Second   NaN
169488  2017-09-07     First   NaN
169502  2017-08-28  Standard   NaN
169551  2017-07-07     First   NaN

[5009 rows x 3 columns]

### Иерархическая индексация

Сначала помещаем символы в столбец:

In [8]:
reindexed = orders.reset_index()

А теперь индексируем датафрейм:

In [9]:
multi_ind = reindexed.set_index(['order_date', 'customer_id'])
multi_ind.head()

                            id ship_mode    sales
order_date customer_id
2014-09-07 DK-13375     100006  Standard  377.970
2014-07-08 EB-13705     100090  Standard  699.192
2014-03-14 NF-18475     100293  Standard   91.056
2014-01-28 JC-15340     100328  Standard    3.928
2014-04-08 JM-15655     100363  Standard   21.376

Наш индекс - это MultiIndex:

In [10]:
type(multi_ind.index)

pandas.core.indexes.multi.MultiIndex

Он имеет два уровня:

In [11]:
len(multi_ind.index.levels)

2

Каждый уровень индекса - это индекс:

In [12]:
multi_ind.index.levels[0]

Index(['2014-01-03', '2014-01-04', '2014-01-05', '2014-01-06', '2014-01-07',
       '2014-01-09', '2014-01-10', '2014-01-11', '2014-01-13', '2014-01-14',
       ...
       '2017-12-21', '2017-12-22', '2017-12-23', '2017-12-24', '2017-12-25',
       '2017-12-26', '2017-12-27', '2017-12-28', '2017-12-29', '2017-12-30'],
      dtype='object', name='order_date', length=1237)

In [13]:
multi_ind.index.levels[1]

Index(['AA-10315', 'AA-10375', 'AA-10480', 'AA-10645', 'AB-10015', 'AB-10060',
       'AB-10105', 'AB-10150', 'AB-10165', 'AB-10255',
       ...
       'VP-21760', 'VS-21820', 'VT-21700', 'VW-21775', 'WB-21850', 'XP-21865',
       'YC-21895', 'YS-21880', 'ZC-21910', 'ZD-21925'],
      dtype='object', name='customer_id', length=793)

In [14]:
multi_ind.xs('2014-03-14').head()

                 id ship_mode     sales
customer_id
NF-18475     100293  Standard    91.056
JF-15295     114510  Standard   280.276
RB-19465     152618     First   583.358
DK-13225     157623  Standard    13.940
CK-12325     125521  Standard  1139.920

Отбираем строки, в которых индекс уровня 0 имеет значение 2014-03-14, без удаления уровней:

In [15]:
multi_ind.xs('2014-03-14', drop_level=False).head()

                            id ship_mode     sales
order_date customer_id
2014-03-14 NF-18475     100293  Standard    91.056
           JF-15295     114510  Standard   280.276
           RB-19465     152618     First   583.358
           DK-13225     157623  Standard    13.940
           CK-12325     125521  Standard  1139.920

Скомбинируем уровни индексов:

In [16]:
multi_ind.xs('2014-03-14').xs('NF-18475')

id             100293
ship_mode    Standard
sales          91.056
Name: NF-18475, dtype: object